package com.application.requireClass;

public class SidoSigunguNMArray {

  public String[] sidoNM = new String[] {"서울", "부산", "대구", "인천", "광주", "대전", "울산", "경기", "강원", "충청", "전라", "경상", "세종" ,"제주"};
  
  public String[] sigunguNM = new String[] {"원주시", "삼척시", "양구군", "화천군", "속초시", "인제군", "동해시", "태백시", "횡성군", "강릉시", "양양군", 
      "춘천시", "영월군", "평창군", "철원군", "정선군", "고성군", "홍천군", "남양주시", "안양시 동안구", "수원시 영통구", "의정부시", "성남시 중원구", "수원시 권선구",
      "파주시", "화성시", "포천시", "시흥시", "용인시 수지구", "하남시", "동두천시", "안양시 만안구", "고양시 일산서구", "고양시 일산동구", "안산시 상록구", "수원시 팔달구",
      "수원시 장안구", "광명시", "군포시", "평택시", "과천시", "광주시", "이천시", "김포시", "안성시", "연천군", "구리시", "안산시 단원구", "성남시 분당구", "양평군",
      "양주시", "용인시 기흥구", "오산시", "가평군", "고양시 덕양구", "성남시 수정구", "부천시", "의왕시", "용인시 처인구", "여주시", "함양군", "김해시", "진주시",
      "산청군", "하동군", "창녕군", "통영시", "남해군", "창원시 진해구", "거제시", "창원시 마산회원구", "창원시 마산합포구", "창원시 의창구", "고성군", "의령군", "합천군",
      "밀양시", "사천시", "거창군", "양산시", "함안군", "창원시 성산구", "울진군", "경산시", "봉화군", "구미시", "영덕군", "울릉군", "성주군", "청도군", "영양군",
      "상주시", "청송군", "예천군", "안동시", "김천시", "군위군", "고령군", "칠곡군", "경주시", "영주시", "의성군", "영천시", "문경시", "포항시 남구", "포항시 북구",
      "광산구", "서구", "동구", "남구", "북구", "달서구", "북구", "중구", "달성군", "수성구", "남구", "동구", "서구", "유성구", "중구", "서구", "대덕구",
      "동구", "강서구", "사상구", "동구", "수영구", "금정구", "기장군", "영도구", "중구", "사하구", "해운대구", "부산진구", "북구", "동래구", "서구", "남구",
      "연제구", "강동구", "도봉구", "은평구", "구로구", "성북구", "강북구", "서대문구", "종로구", "노원구", "강서구", "양천구", "서초구", "영등포구", "마포구",
      "광진구", "송파구", "동작구", "중구", "동대문구", "강남구", "용산구", "성동구", "관악구", "중랑구", "금천구", "북구", "중구", "울주군", "동구", "남구",
      "중구", "연수구", "서구", "옹진군", "동구", "강화군", "남동구", "부평구", "계양구", "미추홀구", "무안군", "광양시", "목포시", "완도군", "신안군", "곡성군",
      "나주시", "영광군", "장성군", "장흥군", "담양군", "순천시", "화순군", "보성군", "여수시", "진도군", "고흥군", "함평군", "해남군", "구례군", "강진군",
      "영암군", "고창군", "익산시", "군산시", "김제시", "남원시", "부안군", "임실군", "전주시 완산구", "전주시 덕진구", "정읍시", "진안군", "순창군", "완주군",
      "무주군", "장수군", "제주시", "서귀포시", "논산시", "천안시 동남구", "당진시", "부여군", "청양군", "태안군", "공주시", "보령시", "서천군", "천안시 서북구",
      "아산시", "홍성군", "예산군", "서산시", "금산군", "계룡시", "옥천군", "음성군", "충주시", "괴산군", "영동군", "제천시", "청주시 서원구", "단양군", "보은군",
      "진천군", "청주시 상당구", "증평군", "청주시 흥덕구", "청주시 청원구"};
  
}
