package com.application.requireClass;

public class StrctArray {

  public String[] strctNM = new String[] { "주용도목적", "조적구조", "벽돌구조", "블록구조", "석구조", "기타조적구조", "콘크리트구조",
      "철근콘크리트구조", "프리케스트콘크리트구조", "기타콘크리트구조", "철골구조", "일반철골구조", "경량철골구조", "강파이프구조", "기타강구조", "철골콘크리트구조",
      "철골철근콘크리트구조", "기타철골철근콘크리트구조", "목구조", "일반목구조", "통나무구조", "기타구조" };
  
  public String[] strctCD = new String[] {"코드", "10", "11", "12", "13", "19", "20", "21", "22", "29", "30", "31",
      "32", "33", "39", "40", "41", "42", "49", "50", "51", "52", "99"};
  
}
